manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
    // b) Az elso updateLeds() az uzemmod szinet gyujtja ki - csak azt az egyet
    const struct { uzemmod mod; int pin; const char* nev; } SZINEK[] = {
      { normalUzemmod, LED_PIROS, "Normal -> piros" },
      { versenyEdzesUzemmod, LED_KEK, "Verseny -> kek" },
      { mediaVezerloUzemmod, LED_ZOLD, "Media -> zold" },
    };
    for (unsigned i = 0; i < sizeof(SZINEK)/sizeof(SZINEK[0]); i++) {
      jelenlegiUzemmod = SZINEK[i].mod;
      updateLeds();
      int pinek[3] = { LED_PIROS, LED_KEK, LED_ZOLD };
      for (int j = 0; j < 3; j++) {
        bool kellVilagitson = (pinek[j] == SZINEK[i].pin);
        if (g_pinOut[pinek[j]] == kellVilagitson) {   // false = vilagit
          std::cout << "HIBA R74: " << SZINEK[i].nev << " - a " << pinek[j]
                    << ". lab allapota rossz\n";
          return 1;
        }
      }
      // c) A beallitott ido utan elalszik, nem eg folyamatosan
      g_millis += ZW_LED_ON_MS + 1;
      updateLeds();
      if (!g_pinOut[LED_PIROS] || !g_pinOut[LED_KEK] || !g_pinOut[LED_ZOLD]) {
        std::cout << "HIBA R74: " << SZINEK[i].nev << " - a LED nem alszik el\n";
        return 1;
      }
    }
    jelenlegiUzemmod = normalUzemmod;
    updateLeds();
    g_millis += ZW_LED_ON_MS + 1;
    updateLeds();
  }
  std::cout << "-- R74 LED: indulaskor sotet, majd az uzemmod szine villan fel\n";

  // A tobbi teszt egy elo kapcsolatot felteteléz (mint a valosagban, amikor
  // egy host csatlakozik). A 0-s handle-t hozzuk fel.
  connectPeer(0, 0xA0);
  std::cout << "-- 1 BLE kapcsolat felepult (conn_hdl=0)\n";

  // 1) PING
  expect(send("PING"), "OK ZWIFT_BUTTONS PROTO=7 MODES=3 BUTTONS=5 EVENTS=3 SLOTS=2 CONNS=2", "PING");
  send("DBG 0");

  // 2) GET: 45 MAP sor + END
  std::string get = send("GET");
  size_t maps = 0, pos = 0;
  while ((pos = get.find("MAP ", pos)) != std::string::npos) { maps++; pos += 4; }
  assert(maps == 45);
  expect(get, "END", "GET/END");
  expect(get, "MAP 0 0 0 1 0 80 0 60", "gyari: normal/G1/rovid = balra nyil (0x50=80)");
  expect(get, "MAP 2 3 2 2 0 234 3 70 0", "gyari: media/G4/hosszu = hangero- ismetlo, kulon leutesek");
  expect(get, "MAP 0 3 1 3 0 0 0 60", "gyari: normal/G4/dupla = uzemmod valtas");
  std::cout << "-- GET ok (" << maps << " sor)\n";

  // 3) SET + visszaolvasas
  expect(send("SET 0 0 0 1 12 21 0 60"), "OK", "SET");
  expect(send("GET"), "MAP 0 0 0 1 12 21 0 60 0", "SET utani GET");
  expect(send("SET 9 0 0 1 0 4 0 60"), "ERR RANGE", "ervenytelen uzemmod");
  expect(send("SET 0 0 0 9 0 4 0 60"), "ERR VALUE", "ervenytelen tipus");
  expect(send("SET 0 0"), "ERR ARGS", "hianyzo argumentum");
  expect(send("HULYESEG"), "ERR UNKNOWN", "ismeretlen parancs");
  std::cout << "-- SET / hibakezeles ok\n";

  // 4) SAVE -> flash, majd ujraindulas szimulacio
  expect(send("SAVE"), "OK SAVED", "SAVE");
  assert(g_fs.count("/keymap.bin") == 1 && g_fs["/keymap.bin"].size() == sizeof(KeymapConfig));
  memset(&keymap, 0, sizeof(keymap));
  assert(loadKeymap());
  assert(keymap.map[0][0][0].modifier == 12 && keymap.map[0][0][0].code == 21);
  std::cout << "-- SAVE/LOAD korbeer, CRC ok\n";

  // 5) serult fajl -> elutasitas
  g_fs["/keymap.bin"][20] ^= 0xFF;
  assert(!loadKeymap());
  std::cout << "-- serult keymap elutasitva (CRC)\n";
  loadDefaultKeymap();

  // 6) Gombesemenyek: Alt+Win+R hosszu nyomasra (normal/G1)
  g_keyCount = g_consumerCount = g_keyReleaseCount = g_consumerReleaseCount = 0;
  longPressStart1();
  assert(g_keyCount == 1 && g_lastKey.code == HID_KEY_R
         && g_lastKey.modifier == (KEYBOARD_MODIFIER_LEFTGUI | KEYBOARD_MODIFIER_LEFTALT));
  longPressStop1();
  std::cout << "-- egyszeri hosszu nyomas ok (mod=0x" << std::hex
            << (int)g_lastKey.modifier << std::dec << ")\n";

  // 7) Ismetlodo hosszu nyomas (normal/G4 = le nyil, 30 ms).
  //    Gyarilag KULON LEUTESEK: minden ismetles utan felengedes is megy ki.
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  g_keyCount = 0; g_keyReleaseCount = 0;
  longPressStart4();
  longPress4();                       // elso ismetles azonnal
  assert(g_keyCount == 1 && g_lastKey.code == HID_KEY_ARROW_DOWN);
  assert(g_keyReleaseCount == 0);     // a felengedes az impulzus vegen jon
  settleTap();
  assert(g_keyReleaseCount == 1);     // most mar felengedve
  longPress4();                       // meg nem telt le az ismetlesi ido
  assert(g_keyCount == 1);
  g_millis += 40;
  longPress4();                       // most igen
  settleTap();
  assert(g_keyCount == 2 && g_keyReleaseCount == 2);
  assert(duringLongpress && !hasKeyPressed);
  longPressStop4();
  // a celpontok megmaradnak: a zaro felengedes a biztonsagi halo
  assert(!duringLongpress && hasKeyPressed);
  loop(); g_millis += 200; loop();
  assert(g_keyReleaseCount == 3);     // egy zaro biztonsagi felengedes
  std::cout << "-- ismetlodo hosszu nyomas kulon leutesekkel ok\n";

  // 7b) Ugyanez NYOMVA TARTVA (rep = csak ZW_REPEAT_ENABLED): a billentyu
  //     lenyomva marad, a felengedest a fociklus kuldi a gomb elengedesekor.
  expect(send("SET 0 3 2 1 0 81 1 30"), "OK", "normal/G4/hosszu -> nyomva tartva");
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  g_keyCount = 0; g_keyReleaseCount = 0;
  longPressStart4();
  longPress4();
  assert(g_keyCount == 1 && g_keyReleaseCount == 0);   // NEM enged fel
  g_millis += 40; longPress4();
  assert(g_keyCount == 2 && g_keyReleaseCount == 0);
  // Nyomva tartott modban a billentyu tenyleg lenyomva van: a tulajdonos ezt
  // jelzi is. A fociklus automatikus felengedeset a duringLongpress tiltja.
  assert(duringLongpress && hasKeyPressed);
  longPressStop4();
  assert(!duringLongpress && hasKeyPressed);
  loop(); g_millis += 200; loop();     // a fociklus engedi fel
  assert(g_keyReleaseCount == 1 && !hasKeyPressed);
  std::cout << "-- ismetlodo hosszu nyomas nyomva tartva ok\n";
  loadDefaultKeymap();

  // 8) Media consumer gomb (media/G2/rovid = play/pause)
  jelenlegiUzemmod = mediaVezerloUzemmod;
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  g_consumerCount = 0;
  click2();
  assert(g_consumerCount == 1 && g_lastKey.consumer
         && g_lastKey.usage == HID_USAGE_CONSUMER_PLAY_PAUSE);
  std::cout << "-- consumer billentyu ok\n";

  // 9) Uzemmod valtas dupla kattintasra + mentes (a valos uton: loop()-on belul)
  jelenlegiUzemmod = normalUzemmod;
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  g_fs.erase("/jelenlegiuzemmod.txt");
  g_pendingCb = doubleclick4;      // a kovetkezo tick()-en sul ki, mint igazibol
  loop();
  assert(jelenlegiUzemmod == versenyEdzesUzemmod);
  assert(g_fs["/jelenlegiuzemmod.txt"] == CONTENTVerseny);
  // MODE parancs szinten a loop()-on belul (handleSerial) fut le
  g_fs.erase("/jelenlegiuzemmod.txt");
  Serial.feed("MODE 2\n");
  loop();
  assert(jelenlegiUzemmod == mediaVezerloUzemmod);
  assert(g_fs["/jelenlegiuzemmod.txt"] == CONTENTMedia);
  std::cout << "-- uzemmod valtas (gomb + MODE parancs) es mentese ok\n";

