manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
  // 10) Nezetvaltas 1-9 korbe
  jelenlegiUzemmod = normalUzemmod; nezet = 0;
  for (int i = 1; i <= 10; i++) {
    hasKeyPressed = false; hasConsumerKeyPressed = false;
    doubleclick5();
    uint8_t want = (uint8_t)(HID_KEY_1 + ((i - 1) % 9));
    if (g_lastKey.code != want) { std::cout << "HIBA nezet " << i << "\n"; return 1; }
  }
  std::cout << "-- nezetvaltas (1-9 korbe) ok\n";

  // 11) BLE nelkul ne ragadjon be az allapot
  Bluefruit.isConnected = false;
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  click1(); click1(); click1();
  assert(!hasKeyPressed && !hasConsumerKeyPressed);
  Bluefruit.isConnected = true;
  click1();
  assert(hasKeyPressed);
  std::cout << "-- BLE kapcsolat nelkuli allapotkezeles ok\n";

  // 12) Tul hosszu parancs
  expect(send(std::string(200, 'X')), "ERR TOOLONG", "tul hosszu parancs");
  expect(send("PING"), "OK ZWIFT_BUTTONS", "tullepes utan helyreall");
  std::cout << "-- parancs-puffer tullepes kezelve\n";

  // ==================== REGRESSZIOS TESZTEK (code review) ====================
  std::cout << "\n--- regresszios tesztek ---\n";

  // R1) A nezet-szamlalo ne csusszon el, ha a billentyu nem ment ki
  loadDefaultKeymap();
  jelenlegiUzemmod = normalUzemmod; nezet = 0;
  Bluefruit.isConnected = false;
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  doubleclick5(); doubleclick5(); doubleclick5();   // BLE nincs -> nem megy ki semmi
  Bluefruit.isConnected = true;
  hasKeyPressed = false; hasConsumerKeyPressed = false;
  doubleclick5();
  if (g_lastKey.code != HID_KEY_1) {
    std::cout << "HIBA R1: nezet elcsuszott, kuldott kod=0x" << std::hex
              << (int)g_lastKey.code << std::dec << " (vart: HID_KEY_1)\n";
    return 1;
  }
  // ugyanez akkor is, ha egy korabbi billentyu meg nincs felengedve
  nezet = 0; hasKeyPressed = true;
  doubleclick5(); doubleclick5();
  hasKeyPressed = false;
  doubleclick5();
  assert(g_lastKey.code == HID_KEY_1);
  std::cout << "-- R1 nezet-szamlalo nem csuszik el\n";

  // R2) Ket gomb egyszerre nyomva: ne ragadjon be a billentyuzet-kod.
  //     Normal uzemmodban G4 hosszu = ismetlodo billentyu, G5 hosszu-t
  //     atallitjuk ismetlodo media billentyure.
  expect(send("SET 0 4 2 2 0 234 1 70"), "OK", "G5 hosszu = ismetlodo media (nyomva tartva)");
  jelenlegiUzemmod = normalUzemmod;
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  duringLongpress = false;
  g_keyCount = g_consumerCount = g_keyReleaseCount = g_consumerReleaseCount = 0;
  longPressStart4(); longPress4();          // G4 ismetel (billentyu)
  assert(g_keyCount == 1);
  longPressStart5(); longPress5();          // G5 atveszi (media)
  assert(g_consumerCount == 1);
  longPressStop4();                          // G4 elengedve (mar nem o ismetel)
  longPressStop5();                          // G5 elengedve
  loop(); g_millis += 200; loop();
  if (g_keyReleaseCount == 0) {
    std::cout << "HIBA R2: a billentyuzet-kod beragadt (nem volt keyRelease)\n";
    return 1;
  }
  assert(g_consumerReleaseCount >= 1);
  assert(!hasKeyPressed && !hasConsumerKeyPressed && !duringLongpress);
  std::cout << "-- R2 ket parhuzamos hosszu nyomas utan minden felengedve\n";
  loadDefaultKeymap();

  // R3) ACT_KEY eseten a 8 bitnel nagyobb kod hibat adjon (ne csonkoljon)
  expect(send("SET 0 0 0 1 0 336 0 60"), "ERR VALUE", "ACT_KEY kod > 0xFF");
  expect(send("SET 0 0 0 2 0 336 0 60"), "OK", "ACT_CONSUMER kod > 0xFF megengedett");
  expect(send("GET"), "MAP 0 0 0 2 0 336 0 60 0", "consumer kod valtozatlan");
  loadDefaultKeymap();
  std::cout << "-- R3 tul nagy billentyukod elutasitva, media kod atmegy\n";

  // R4) Sikertelen mentes ne semmisitse meg a korabbi kiosztast
  expect(send("SET 1 1 1 1 0 4 0 60"), "OK", "elso kiosztas");
  assert(saveKeymap());
  std::string savedGood = g_fs["/keymap.bin"];
  expect(send("SET 1 1 1 1 0 5 0 60"), "OK", "masodik kiosztas");
  g_fsWriteFail = true;                      // a flash iras most elromlik
  bool ok = saveKeymap();
  g_fsWriteFail = false;
  assert(!ok);
  if (g_fs.count("/keymap.bin") == 0) {
    std::cout << "HIBA R4: a sikertelen mentes torolte a regi kiosztast\n";
    return 1;
  }
  assert(g_fs["/keymap.bin"] == savedGood);
  assert(g_fs.count("/keymap.tmp") == 0);    // ne maradjon szemet
  memset(&keymap, 0, sizeof(keymap));
  assert(loadKeymap() && keymap.map[1][1][1].code == 4);
  std::cout << "-- R4 sikertelen mentes utan a regi kiosztas megmaradt\n";

  // R5) Sikeres mentes utan sincs ideiglenes fajl
  assert(saveKeymap());
  assert(g_fs.count("/keymap.tmp") == 0);
  std::cout << "-- R5 sikeres mentes nem hagy ideiglenes fajlt\n";

  // R6) Sikertelen uzemmod-mentes ne semmisitse meg a korabbi erteket
  //     (a hosszabb -> rovidebb irany a kritikus: "versenyEdzesUzemmod" -> "normalUzemmod")
  g_fs.erase("/jelenlegiuzemmod.txt");
  saveUzemmod(CONTENTVerseny);
  assert(g_fs["/jelenlegiuzemmod.txt"] == CONTENTVerseny);
  g_fsWriteFail = true;
  saveUzemmod(CONTENTNormal);              // a flash iras elromlik
  g_fsWriteFail = false;
  if (g_fs.count("/jelenlegiuzemmod.txt") == 0) {
    std::cout << "HIBA R6: a sikertelen mentes torolte a korabbi uzemmodot\n";
    return 1;
  }
  if (g_fs["/jelenlegiuzemmod.txt"] != CONTENTVerseny) {
    std::cout << "HIBA R6: serult uzemmod-fajl: '"
              << g_fs["/jelenlegiuzemmod.txt"] << "'\n";
    return 1;
  }
  assert(g_fs.count("/jelenlegiuzemmod.tmp") == 0);
  std::cout << "-- R6 sikertelen uzemmod-mentes utan a regi ertek megmaradt\n";

  // R7) Hosszabb -> rovidebb ertek irasakor ne maradjon szemet a vegen
  saveUzemmod(CONTENTNormal);
  if (g_fs["/jelenlegiuzemmod.txt"] != CONTENTNormal) {
    std::cout << "HIBA R7: '" << g_fs["/jelenlegiuzemmod.txt"]
              << "' (vart: " << CONTENTNormal << ")\n";
    return 1;
  }
  assert(g_fs.count("/jelenlegiuzemmod.tmp") == 0);
  // es a boot-logika is helyesen olvassa vissza
  assert(readStoredMode() == normalUzemmod);
  std::cout << "-- R7 rovidebb ertek irasakor nem marad szemet a fajl vegen\n";

  // R8) A media billentyuk a VALODI kapcsolat-azonositora menjenek, ne a
  //     hardkodolt 0-ra. Szandekosan olyan handle-t hasznalunk, ami nem 0.
  disconnectPeer(0);
  connectPeer(2, 0xC0);
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  jelenlegiUzemmod = mediaVezerloUzemmod;
  resetKeyState();
  g_lastConnHdl = 99;
  click2();                                  // media/G2/rovid = play/pause
  assert(g_consumerCount == 1);
  if (g_lastConnHdl != 2) {
    std::cout << "HIBA R8: a media billentyu conn_hdl=" << g_lastConnHdl
              << " -re ment, pedig az elo kapcsolat a 2-es\n";
    return 1;
  }
  // ugyanez az ismetlodo hosszu nyomasnal (media/G4/hosszu = hangero -)
  resetKeyState();
  g_lastConnHdl = 99;
  longPressStart4(); longPress4();
  assert(g_lastKey.consumer);
  if (g_lastConnHdl != 2) {
    std::cout << "HIBA R8: az ismetlodo media kuldes conn_hdl=" << g_lastConnHdl << "\n";
    return 1;
  }
  longPressStop4();
  std::cout << "-- R8 media billentyuk a valodi kapcsolat-azonositora mennek\n";
  disconnectPeer(2);
  connectPeer(0, 0xA0);                      // alaphelyzet a kovetkezo tesztekhez

