manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
  // ==================== TOBB EGYIDEJU KAPCSOLAT ====================
  std::cout << "\n--- ket eszkoz egyszerre ---\n";

  // R9) Gyari cel-beallitasok
  loadDefaultKeymap();
  assert(keymap.modeTarget[0] == ZW_TARGET_PC);
  assert(keymap.modeTarget[1] == ZW_TARGET_PC);
  assert(keymap.modeTarget[2] == ZW_TARGET_ALL);
  expect(send("GET"), "TARGET 0 1", "Normal -> csak PC");
  expect(send("GET"), "TARGET 1 1", "Verseny -> csak PC");
  expect(send("GET"), "TARGET 2 3", "Media -> mindketto");
  std::cout << "-- R9 gyari celpontok: Normal/Verseny=PC, Media=mindketto\n";

  // R10) Masodik eszkoz csatlakozasa + hirdetes ujrainditasa
  int advBefore = Bluefruit.Advertising.startCount;
  connectPeer(1, 0xB0);
  assert(connHandles[0] == 0 && connHandles[1] == 1);
  // ket kapcsolat van, tobb hely nincs -> ne hirdessen tovabb
  assert(Bluefruit.Advertising.startCount == advBefore);
  std::cout << "-- R10 masodik eszkoz csatlakozott, a hirdetes leallt\n";

  // R11) Hozzarendeles nelkul minden kapcsolatra megy (kicsomagolas utani allapot)
  expect(send("CLEARSLOT 0"), "OK", "0-s fiok torlese");
  expect(send("CLEARSLOT 1"), "OK", "1-es fiok torlese");
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  click1();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 1);
  std::cout << "-- R11 hozzarendeles nelkul mindket eszkoz megkapja\n";

  // R12) Fiokok hozzarendelese: conn 0 = PC, conn 1 = telefon
  expect(send("ASSIGN 0 0"), "OK", "PC = conn 0");
  expect(send("ASSIGN 1 1"), "OK", "telefon = conn 1");
  expect(send("PEERS"), "CONN 0 A5:A4:A3:A2:A1:A0 0", "conn 0 a 0-s fiokban");
  expect(send("PEERS"), "CONN 1 B5:B4:B3:B2:B1:B0 1", "conn 1 az 1-es fiokban");
  expect(send("PEERS"), "SLOT 0 1 A5:A4:A3:A2:A1:A0", "0-s fiok cime");
  std::cout << "-- R12 fiok-hozzarendeles BLE cim alapjan\n";

  // R13) Normal uzemmod: CSAK a PC kapja meg
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  click1();
  if (!(g_sentTo[0] == 1 && g_sentTo[1] == 0)) {
    std::cout << "HIBA R13: Normal uzemmodban PC=" << g_sentTo[0]
              << " telefon=" << g_sentTo[1] << " (vart: 1 / 0)\n";
    return 1;
  }
  // a felengedes is csak a PC-re megy
  g_millis += 200; loop(); g_millis += 200; loop();
  assert(g_keyReleaseCount == 1);
  std::cout << "-- R13 Normal uzemmod: csak a PC kap gombnyomast es felengedest\n";

  // R14) Media uzemmod: MINDKET eszkoz megkapja
  jelenlegiUzemmod = mediaVezerloUzemmod;
  resetKeyState();
  click2();                       // media/G2/rovid = play/pause
  if (!(g_sentTo[0] == 1 && g_sentTo[1] == 1)) {
    std::cout << "HIBA R14: Media uzemmodban PC=" << g_sentTo[0]
              << " telefon=" << g_sentTo[1] << " (vart: 1 / 1)\n";
    return 1;
  }
  assert(pressedTargetCount == 2);
  g_millis += 200; loop(); g_millis += 200; loop();
  assert(g_consumerReleaseCount == 2);   // mindket kapcsolatra megy a felengedes
  std::cout << "-- R14 Media uzemmod: mindket eszkoz kap gombnyomast es felengedest\n";

  // R15) Csak telefon
  expect(send("SETTARGET 0 2"), "OK", "Normal -> csak telefon");
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  click1();
  assert(g_sentTo[0] == 0 && g_sentTo[1] == 1);
  expect(send("SETTARGET 0 1"), "OK", "vissza PC-re");
  expect(send("SETTARGET 0 0"), "ERR VALUE", "ures maszk elutasitva");
  expect(send("SETTARGET 0 4"), "ERR VALUE", "ismeretlen bit elutasitva");
  expect(send("SETTARGET 9 1"), "ERR RANGE", "ervenytelen uzemmod");
  std::cout << "-- R15 celpont atallithato, ervenytelen maszk elutasitva\n";

  // R16) Ha a celeszkoz nincs csatlakozva, ne menjen ki semmi (es ne ragadjon be)
  jelenlegiUzemmod = normalUzemmod;      // celpont: PC (conn 0)
  disconnectPeer(0);
  resetKeyState();
  click1();
  assert(g_keyCount == 0 && !hasKeyPressed);
  // a telefon celpontu uzemmod viszont mukodik
  jelenlegiUzemmod = mediaVezerloUzemmod;
  resetKeyState();
  click2();
  assert(g_sentTo[1] == 1 && g_consumerCount == 1);
  std::cout << "-- R16 nem csatlakozott celeszkoznel nem ragad be az allapot\n";

  // R17) A PC visszacsatlakozasakor a hirdetes ujraindul, es a fiok megmarad
  advBefore = Bluefruit.Advertising.startCount;
  connectPeer(0, 0xA0);
  assert(slotOfConn(0) == ZW_SLOT_PC);   // BLE cim alapjan visszatalal
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  click1();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 0);
  std::cout << "-- R17 visszacsatlakozas utan a fiok-hozzarendeles megmarad\n";

  // R18) A konfiguracio (celpontok + fiokok) tulel egy mentes/betoltes kort
  expect(send("SETTARGET 1 3"), "OK", "Verseny -> mindketto");
  assert(saveKeymap());
  memset(&keymap, 0, sizeof(keymap));
  assert(loadKeymap());
  assert(keymap.modeTarget[1] == ZW_TARGET_ALL);
  assert(keymap.peers[ZW_SLOT_PC].valid && keymap.peers[ZW_SLOT_PHONE].valid);
  assert(keymap.peers[ZW_SLOT_PC].addr[0] == 0xA0);
  std::cout << "-- R18 celpontok es fiokok tuleltek a flash korbeerest\n";

  // R19) A gyari visszaallitas megtartja a fiok-hozzarendelest
  expect(send("DEFAULTS"), "OK DEFAULTS", "gyari visszaallitas");
  assert(keymap.modeTarget[1] == ZW_TARGET_PC);         // celpont visszaall
  assert(keymap.peers[ZW_SLOT_PC].valid);               // de a fiok megmarad
  assert(keymap.peers[ZW_SLOT_PC].addr[0] == 0xA0);
  std::cout << "-- R19 gyari visszaallitas nem torli a PC/telefon hozzarendelest\n";

  // R20) Ugyanaz az eszkoz ne kerulhessen ket fiokba
  expect(send("ASSIGN 1 0"), "OK", "conn 0 athelyezese az 1-es fiokba");
  assert(!keymap.peers[0].valid);        // a regi hozzarendeles megszunt
  assert(keymap.peers[1].valid && keymap.peers[1].addr[0] == 0xA0);
  expect(send("ASSIGN 0 7"), "ERR NOTCONNECTED", "nem letezo kapcsolat");
  expect(send("ASSIGN 9 0"), "ERR RANGE", "ervenytelen fiok");
  std::cout << "-- R20 egy eszkoz csak egy fiokban lehet\n";

  // ==================== MASODIK KOROS REVIEW JAVITASAI ====================
  std::cout << "\n--- masodik koros regresszio ---\n";
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1);
  connectPeer(0, 0xA0); connectPeer(1, 0xB0);
  send("ASSIGN 0 0"); send("ASSIGN 1 1");

  // R21) Egy kapcsolat bontasa ne hagyja beragadva a masikra kiment billentyut
  jelenlegiUzemmod = mediaVezerloUzemmod;      // celpont: mindketto
  resetKeyState();
  click2();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 1 && pressedTargetCount == 2);
  disconnectPeer(0);                            // a PC lecsatlakozik
  g_millis += 200; loop(); g_millis += 200; loop();
  if (g_consumerReleaseCount == 0) {
    std::cout << "HIBA R21: a telefonon beragadt a billentyu (nem volt felengedes)\n";
    return 1;
  }
  assert(!hasConsumerKeyPressed && pressedTargetCount == 0);
  std::cout << "-- R21 egy kapcsolat bontasa nem ragasztja be a masikat\n";
  connectPeer(0, 0xA0);

  // R22) A nezet-szamlalo ne csusszon el, ha a celeszkoz nincs csatlakozva
  expect(send("SETTARGET 0 1"), "OK", "Normal -> csak PC");
  jelenlegiUzemmod = normalUzemmod;
  nezet = 0;
  disconnectPeer(0);                            // a PC (a celpont) nincs fent
  resetKeyState();
  doubleclick5(); doubleclick5(); doubleclick5();
  if (nezet != 0) {
    std::cout << "HIBA R22: a nezet-szamlalo " << nezet
              << "-re lepett, pedig egy billentyu sem ment ki\n";
    return 1;
  }
  connectPeer(0, 0xA0);
  resetKeyState();
  doubleclick5();
  assert(g_lastKey.code == HID_KEY_1 && nezet == 1);
  std::cout << "-- R22 nezet-szamlalo nem lep, ha a celeszkoz nincs fent\n";

  // R23) disconnectBle() a valodi azonositokon menjen vegig (ne 0..count-1)
  disconnectPeer(0);                            // csak az 1-es handle marad elo
  assert(connHandles[0] == BLE_CONN_HANDLE_INVALID);
  g_disconnected.clear();
  ble_sleep();
  if (std::find(g_disconnected.begin(), g_disconnected.end(), (uint16_t)1)
      == g_disconnected.end()) {
    std::cout << "HIBA R23: az 1-es azonositoju kapcsolat bontatlan maradt "
                 "(bontva: " << g_disconnected.size() << " db)\n";
    return 1;
  }
  std::cout << "-- R23 alvas elott minden elo kapcsolat bontasra kerul\n";
  connectPeer(0, 0xA0);

  // R24) Parositatlan kapcsolat: ne lehessen fiokhoz rendelni, es ne is
  //      azonositsuk (a cime valtozo, tehat ertelmetlen elmenteni)
  disconnectPeer(1);
  connectPeer(1, 0xE0, /*bonded=*/false);
  expect(send("ASSIGN 1 1"), "ERR NOTBONDED", "parositatlan kapcsolat elutasitva");
  assert(slotOfConn(1) == -1);
  expect(send("PEERS"), "CONN 1 E5:E4:E3:E2:E1:E0 -1 0", "PEERS jelzi: nincs parositva");
  g_conns[1].bonded = true;                     // parositas megtortent
  expect(send("ASSIGN 1 1"), "OK", "parositas utan mar hozzarendelheto");
  expect(send("PEERS"), "CONN 1 E5:E4:E3:E2:E1:E0 1 1", "PEERS jelzi: parositva");
  std::cout << "-- R24 csak parositott kapcsolat rendelheto fiokhoz\n";

