manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
  // R38) Nagy ismetlesi idonel a billentyu ne maradjon lenyomva
  //      (ez volt a "beragadtnak tunik Windows alatt" hiba)
  expect(send("SET 0 3 2 1 0 81 3 2000"), "OK", "normal/G4/hosszu: 2000 ms, kulon leutesek");
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  longPressStart4(); longPress4(); settleTap();
  assert(g_keyCount == 1);
  if (g_keyReleaseCount != 1) {
    std::cout << "HIBA R38: az ismetles utan nem ment ki felengedes -> a host "
                 "vegig lenyomva tartottnak latja\n";
    return 1;
  }
  // 2 masodpercig nem tortenik semmi tovabbi
  for (int i = 0; i < 50; i++) { g_millis += 20; longPress4(); updateRepeatTap(); }
  assert(g_keyCount == 1 && g_keyReleaseCount == 1);
  g_millis += 1100;
  longPress4(); settleTap();
  assert(g_keyCount == 2 && g_keyReleaseCount == 2);
  longPressStop4();
  loop(); g_millis += 200; loop();
  assert(g_keyCount == 2 && g_keyReleaseCount == 3);   // + zaro biztonsagi felengedes
  std::cout << "-- R38 2000 ms-os ismetles: 2 leutes, 2 felengedes, semmi tobb\n";

  // R39) Nyomva tartva modban viszont NINCS kozbenso felengedes
  expect(send("SET 0 3 2 1 0 81 1 2000"), "OK", "ugyanaz nyomva tartva");
  resetKeyState();
  longPressStart4(); longPress4();
  assert(g_keyCount == 1 && g_keyReleaseCount == 0);
  g_millis += 2100; longPress4();
  assert(g_keyCount == 2 && g_keyReleaseCount == 0);
  longPressStop4();
  loop(); g_millis += 200; loop();
  assert(g_keyReleaseCount == 1);      // egyetlen felengedes a vegen
  std::cout << "-- R39 nyomva tartva modban csak a vegen van felengedes\n";

  // R40) Media (consumer) billentyunel is mukodik a kulon leutes
  expect(send("SET 2 3 2 2 0 234 3 100"), "OK", "media/G4/hosszu: kulon leutesek");
  jelenlegiUzemmod = mediaVezerloUzemmod;
  resetKeyState();
  longPressStart4(); longPress4(); settleTap();
  assert(g_consumerCount == 1 && g_consumerReleaseCount == 1);
  assert(g_keyReleaseCount == 0);      // billentyuzet-felengedes nem megy ki
  g_millis += 150; longPress4(); settleTap();
  assert(g_consumerCount == 2 && g_consumerReleaseCount == 2);
  longPressStop4();
  loop(); g_millis += 200; loop();
  assert(g_consumerReleaseCount == 3); // + zaro biztonsagi felengedes
  std::cout << "-- R40 media billentyu kulon leutesekkel, felesleges esemeny nelkul\n";

  // R41) Ket eszkoznel mindkettore megy a felengedes is
  connectPeer(1, 0xB0);
  expect(send("SETTARGET 2 3"), "OK", "media -> mindketto");
  resetKeyState();
  longPressStart4(); longPress4(); settleTap();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 1);
  assert(g_consumerReleaseCount == 2);   // kapcsolatonkent egy felengedes
  longPressStop4();
  std::cout << "-- R41 ket eszkoznel a felengedes is mindkettore megy\n";

  // R42) Ervenyesseg: a rep mezo bitmaszk
  expect(send("SET 0 3 2 1 0 81 3 100"), "OK", "rep=3 elfogadva");
  expect(send("SET 0 3 2 1 0 81 2 100"), "ERR VALUE", "rep=2 (RELEASE ismetles nelkul) elutasitva");
  expect(send("SET 0 3 2 1 0 81 5 100"), "ERR VALUE", "rep=5 (HOLD_MOD RELEASE nelkul) elutasitva");
  expect(send("SET 0 3 2 1 0 81 4 100"), "ERR VALUE", "rep=4 (csak HOLD_MOD) elutasitva");
  expect(send("SET 0 3 2 1 0 81 6 100"), "ERR VALUE", "rep=6 elutasitva");
  expect(send("SET 0 3 2 1 0 81 0 100"), "OK", "rep=0 (nincs ismetles) rendben");
  expect(send("SET 0 3 2 1 0 81 1 100"), "OK", "rep=1 (nyomva tartva) rendben");
  expect(send("SET 0 3 2 1 0 81 8 100"), "ERR VALUE", "rep=8 elutasitva");
  // rep=0 utan a hosszu nyomas egyszeri kuldes, nem ismetles
  expect(send("SET 0 3 2 1 0 81 0 100"), "OK", "nincs ismetles");
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  longPressStart4();
  int afterFirst = g_keyCount;
  assert(afterFirst > 0);                // egyszeri kuldes tortent
  longPress4(); g_millis += 200; longPress4();
  if (g_keyCount != afterFirst) {
    std::cout << "HIBA R42: nem ismetlodo muvelet ismetelt\n";
    return 1;
  }
  longPressStop4();
  std::cout << "-- R42 rep mezo ervenyessege es a csak-RELEASE bit kezelese\n";
  loadDefaultKeymap();

  // ==================== ALT+TAB: MODOSITO NYOMVA TARTASA ====================
  std::cout << "\n--- modosito nyomva tartasa ismetles kozben ---\n";
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1); connectPeer(0, 0xA0);

  // R43) Gyari Alt+Tab: ismetlodo, kulon leutesek, a modosito nyomva marad
  const KeyAction& altTab = keymap.map[2][1][EV_LONG];
  assert(altTab.type == ACT_KEY && altTab.code == HID_KEY_TAB);
  assert(altTab.modifier == KEYBOARD_MODIFIER_LEFTALT);
  assert(altTab.repeat == (ZW_REPEAT_ENABLED | ZW_REPEAT_RELEASE | ZW_REPEAT_HOLD_MOD));
  jelenlegiUzemmod = mediaVezerloUzemmod;
  resetKeyState();
  longPressStart2(); longPress2(); settleTap();
  assert(g_keyCount == 1 && g_lastPressedCode == HID_KEY_TAB);
  // az ismetles utani "felengedes" jelentesben az ALT-nak benne kell maradnia
  if (g_lastModifier != KEYBOARD_MODIFIER_LEFTALT) {
    std::cout << "HIBA R43: az ismetles utan a modosito is felengedodott "
                 "(mod=0x" << std::hex << (int)g_lastModifier << std::dec
              << ") -> a Windows csak ket ablak kozott valtana\n";
    return 1;
  }
  assert(g_keyReleaseCount == 1);      // a Tab felengedve, az Alt nem
  // masodik lepes: ujabb Tab, az Alt vegig nyomva
  g_millis += 600; longPress2(); settleTap();
  assert(g_keyCount == 2 && g_lastPressedCode == HID_KEY_TAB
         && g_lastModifier == KEYBOARD_MODIFIER_LEFTALT);
  // a gomb elengedesekor viszont az ALT is felengedodik
  longPressStop2();
  assert(hasKeyPressed && pressedTargetCount == 1);   // van meg mit felengedni
  loop(); g_millis += 200; loop();
  if (g_lastModifier != 0) {
    std::cout << "HIBA R43: a gomb elengedese utan az Alt nyomva maradt\n";
    return 1;
  }
  assert(!hasKeyPressed);
  std::cout << "-- R43 Alt+Tab: az Alt vegig nyomva, a vegen felengedve\n";

  // R44) HOLD_MOD nelkul a modosito is felengedodik minden ismetlesnel
  expect(send("SET 2 1 2 1 4 43 3 500 1"), "OK", "Alt+Tab HOLD_MOD nelkul");
  resetKeyState();
  longPressStart2(); longPress2(); settleTap();
  assert(g_keyCount == 1);
  if (g_lastModifier != 0) {
    std::cout << "HIBA R44: HOLD_MOD nelkul is nyomva maradt a modosito\n";
    return 1;
  }
  longPressStop2();
  loop(); g_millis += 200; loop();
  assert(!hasKeyPressed);
  std::cout << "-- R44 HOLD_MOD nelkul a modosito is felengedodik\n";

