manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
  // R45) HOLD_MOD modosito nelkuli billentyunel nem valtoztat semmin
  expect(send("SET 0 3 2 1 0 81 7 100"), "OK", "le nyil, HOLD_MOD-dal (nincs modosito)");
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  longPressStart4(); longPress4(); settleTap();
  assert(g_keyCount == 1 && g_keyReleaseCount == 1);
  assert(g_lastModifier == 0);          // teljes felengedes, mint HOLD_MOD nelkul
  longPressStop4();
  std::cout << "-- R45 modosito nelkul a HOLD_MOD nem valtoztat semmin\n";

  // R46) Ervenyesseg: a rep mezo mar 0..7
  expect(send("SET 0 3 2 1 0 81 7 100"), "OK", "rep=7 elfogadva");
  expect(send("SET 0 3 2 1 0 81 8 100"), "ERR VALUE", "rep=8 elutasitva");
  std::cout << "-- R46 rep mezo ervenyessege 0..7\n";
  loadDefaultKeymap();

  // ==================== FUNKCIONALIS ATFESULES ====================
  std::cout << "\n--- funkcionalis atfesules ---\n";
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1); connectPeer(0, 0xA0);

  // F1) LOAD parancs: a flash-ben levo allapotot tolti vissza
  expect(send("SET 0 0 0 1 0 4 0 60"), "OK", "modositas (A billentyu)");
  expect(send("SAVE"), "OK SAVED", "mentes");
  expect(send("SET 0 0 0 1 0 5 0 60"), "OK", "ujabb modositas (B billentyu)");
  expect(send("GET"), "MAP 0 0 0 1 0 5 0 60 0", "a RAM-ban a B van");
  expect(send("LOAD"), "OK LOADED", "visszatoltes");
  expect(send("GET"), "MAP 0 0 0 1 0 4 0 60 0", "a LOAD utan ujra az A");
  std::cout << "-- F1 LOAD parancs visszatolt a flash-bol\n";

  // F2) LOAD ervenytelen fajlnal hibat ad, es nem rontja el a RAM-ot
  g_fs["/keymap.bin"][30] ^= 0xFF;                  // CRC serules
  expect(send("SET 0 0 0 1 0 6 0 60"), "OK", "RAM-ban C billentyu");
  expect(send("LOAD"), "ERR LOAD", "serult fajl elutasitva");
  expect(send("GET"), "MAP 0 0 0 1 0 6 0 60 0", "a RAM valtozatlan maradt");
  g_fs.erase("/keymap.bin");
  expect(send("LOAD"), "ERR LOAD", "hianyzo fajl elutasitva");
  std::cout << "-- F2 hibas/hianyzo mentes nem rontja el a memoriat\n";

  // F3) Parancs-ertelmezes: kis/nagybetu, ismeretlen, ures, hianyos
  expect(send("ping"), "OK ZWIFT_BUTTONS", "kisbetus parancs");
  expect(send("PiNg"), "OK ZWIFT_BUTTONS", "vegyes betus parancs");
  expect(send("NINCSILYEN"), "ERR UNKNOWN", "ismeretlen parancs");
  expect(send("SET"), "ERR ARGS", "parameter nelkuli SET");
  expect(send("SET 0 0 0"), "ERR ARGS", "hianyos SET");
  expect(send("SETTARGET"), "ERR ARGS", "parameter nelkuli SETTARGET");
  expect(send("ASSIGN"), "ERR ARGS", "parameter nelkuli ASSIGN");
  expect(send("CLEARSLOT"), "ERR ARGS", "parameter nelkuli CLEARSLOT");
  std::cout << "-- F3 parancs-ertelmezes es hianyos parameterek\n";

  // F4) Szamertek-hatarok: a negativ ertek elojeltelenul olvasva tullep
  expect(send("SET 0 0 0 1 0 -1 0 60"), "ERR VALUE", "negativ kod elutasitva");
  expect(send("SET 0 0 0 1 -1 4 0 60"), "ERR VALUE", "negativ modosito elutasitva");
  expect(send("SET -1 0 0 1 0 4 0 60"), "ERR RANGE", "negativ uzemmod elutasitva");
  expect(send("SET 0 9 0 1 0 4 0 60"), "ERR RANGE", "tul nagy gombszam");
  expect(send("SET 0 0 9 1 0 4 0 60"), "ERR RANGE", "tul nagy esemeny");
  expect(send("MODE 9"), "ERR RANGE", "tul nagy uzemmod");
  expect(send("CLEARSLOT 9"), "ERR RANGE", "tul nagy fiok");
  std::cout << "-- F4 szamertek-hatarok mindenhol ellenorizve\n";

  // F5) MODE parameter nelkul az aktualisat jelenti
  jelenlegiUzemmod = versenyEdzesUzemmod;
  expect(send("MODE"), "OK MODE 1", "MODE parameter nelkul");
  expect(send("MODE 0"), "OK MODE 0", "MODE 0");
  assert(jelenlegiUzemmod == normalUzemmod);
  std::cout << "-- F5 MODE lekerdezes es beallitas\n";

  // F6) DBG oda-vissza kapcsolhato
  expect(send("DBG 1"), "OK DBG 1", "debug be");
  assert(debugSerial);
  expect(send("DBG 0"), "OK DBG 0", "debug ki");
  assert(!debugSerial);
  std::cout << "-- F6 DBG kapcsolo\n";

  // F7) Uzemmod-valtas BLE kapcsolat nelkul is mukodik
  loadDefaultKeymap();
  Bluefruit.isConnected = false;
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  doubleclick4();
  if (jelenlegiUzemmod != versenyEdzesUzemmod) {
    std::cout << "HIBA F7: BLE nelkul nem valt uzemmodot\n";
    return 1;
  }
  Bluefruit.isConnected = true;
  jelenlegiUzemmod = normalUzemmod;
  std::cout << "-- F7 uzemmod-valtas BLE nelkul is megy\n";

  // F8) Nezetvaltas korbeer 9 utan
  nezet = 0;
  for (int i = 1; i <= 11; i++) {
    resetKeyState();
    doubleclick5();
    uint8_t want = (uint8_t)(HID_KEY_1 + ((i - 1) % 9));
    if (g_lastPressedCode != want) {
      std::cout << "HIBA F8: " << i << ". nezet 0x" << std::hex << (int)g_lastPressedCode
                << " (vart 0x" << (int)want << ")" << std::dec << "\n";
      return 1;
    }
  }
  std::cout << "-- F8 nezetvaltas korbeer (11 lepes at a 9-en)\n";

  // F9) Minden gomb minden esemenye kikuld valamit a gyari kiosztassal
  loadDefaultKeymap();
  for (uint8_t m = 0; m < ZW_NUM_MODES; m++) {
    jelenlegiUzemmod = (uzemmod)m;
    for (uint8_t b = 0; b < ZW_NUM_BUTTONS; b++) {
      for (uint8_t e = 0; e < ZW_NUM_EVENTS; e++) {
        const KeyAction& a = keymap.map[m][b][e];
        if (a.type != ACT_KEY && a.type != ACT_CONSUMER) continue;
        resetKeyState();
        // az adott gomb adott esemenye
        void (*fns[5][3])() = {
          {click1, doubleclick1, longPressStart1}, {click2, doubleclick2, longPressStart2},
          {click3, doubleclick3, longPressStart3}, {click4, doubleclick4, longPressStart4},
          {click5, doubleclick5, longPressStart5}};
        fns[b][e]();
        if (e == EV_LONG && isRepeating(a)) {
          void (*during[5])() = {longPress1, longPress2, longPress3, longPress4, longPress5};
          during[b]();
        }
        if (g_keyCount + g_consumerCount == 0) {
          std::cout << "HIBA F9: uzemmod " << (int)m << " gomb " << (b + 1)
                    << " esemeny " << (int)e << " nem kuldott semmit\n";
          return 1;
        }
        void (*stops[5])() = {longPressStop1, longPressStop2, longPressStop3,
                              longPressStop4, longPressStop5};
        if (e == EV_LONG) stops[b]();
      }
    }
  }
  std::cout << "-- F9 mind a 45 gyari bejegyzes kikuld valamit\n";
  jelenlegiUzemmod = normalUzemmod;

