manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
  // ==================== NEGYEDIK KOROS REVIEW ====================
  std::cout << "\n--- negyedik koros regresszio ---\n";
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1); connectPeer(0, 0xA0);

  // R47) Uzemmod-valtas ismetles kozben ne szorja fekezetlenul a billentyut
  jelenlegiUzemmod = mediaVezerloUzemmod;      // G5 hosszu = hangero+, ismetlodo
  resetKeyState();
  longPressStart5(); longPress5(); settleTap();
  assert(g_consumerCount == 1);
  jelenlegiUzemmod = normalUzemmod;            // masik ujjal uzemmodot valtunk
  int before47 = g_keyCount;
  for (int i = 0; i < 20; i++) { g_millis += 25; longPress5(); updateRepeatTap(); }
  if (g_keyCount - before47 > 1) {
    std::cout << "HIBA R47: uzemmod-valtas utan " << (g_keyCount - before47)
              << " billentyu ment ki fekezetlenul\n";
    return 1;
  }
  assert(repeatButton == -1);                  // az ismetles lezarult
  assert(g_consumerReleaseCount >= 1);         // a media billentyu felengedve
  longPressStop5();
  std::cout << "-- R47 uzemmod-valtas ismetles kozben rendesen lezarja azt\n";

  // R48) Valodi 2-es/3-as formatumu (8 bajtos bejegyzesu) mentes betoltese.
  // A fajl tenyleg a regi szerkezet, nem csak atirt verziomezo.
  for (uint16_t ver = 2; ver <= 3; ver++) {
    loadDefaultKeymap();
    KeymapConfigV3 old3;
    memset(&old3, 0, sizeof(old3));
    old3.magic = ZW_KEYMAP_MAGIC;
    old3.version = ver;
    old3.entrySize = sizeof(KeyActionV3);
    old3.modes = ZW_NUM_MODES; old3.buttons = ZW_NUM_BUTTONS;
    old3.events = ZW_NUM_EVENTS; old3.slots = ZW_NUM_SLOTS;
    for (uint8_t m = 0; m < 3; m++)
      for (uint8_t b = 0; b < 5; b++)
        for (uint8_t e = 0; e < 3; e++) {
          const KeyAction& src = keymap.map[m][b][e];
          KeyActionV3& dst = old3.map[m][b][e];
          dst.type = src.type; dst.modifier = src.modifier; dst.code = src.code;
          // a regi formatumban az ismetles mindig a "nyomva tartva" mod volt
          dst.repeat = src.repeat ? (ver == 2 ? ZW_REPEAT_ENABLED : src.repeat) : 0;
          dst.target = src.target; dst.repeatMs = src.repeatMs;
        }
    memcpy(old3.modeTarget, keymap.modeTarget, sizeof(old3.modeTarget));
    memcpy(old3.peers, keymap.peers, sizeof(old3.peers));
    old3.crc = zwCrc32((const uint8_t*)&old3, sizeof(old3) - sizeof(uint32_t));
    assert(writeFileAtomic("/keymap.bin", "/keymap.tmp", &old3, sizeof(old3)));

    memset(&keymap, 0, sizeof(keymap));
    if (!loadKeymap()) {
      std::cout << "HIBA R48: a " << ver << "-es formatumu mentes nem toltodott be\n";
      return 1;
    }
    if (keymap.version != ZW_KEYMAP_VERSION || keymap.entrySize != sizeof(KeyAction)) {
      std::cout << "HIBA R48: a betoltott kiosztas nem az uj formatum lett\n";
      return 1;
    }
    // a kiosztas tartalma atjott
    assert(keymap.map[0][0][0].type == ACT_KEY && keymap.map[0][0][0].code == HID_KEY_ARROW_LEFT);
    assert(keymap.modeTarget[2] == ZW_TARGET_ALL);
    assert(keymap.map[2][0][EV_LONG].target == ZW_TARGET_PC);
    // az uj mezo a korabbi viselkedest jelento 0
    assert(keymap.map[0][0][0].holdMs == 0);
    // 2-es mentesnel a beragadt-billentyu javitas is eljut ide
    if (ver == 2 && keymap.map[0][3][2].repeat != (ZW_REPEAT_ENABLED | ZW_REPEAT_RELEASE)) {
      std::cout << "HIBA R48: a regi repeat=1 nem alakult at (kapott "
                << (int)keymap.map[0][3][2].repeat << ")\n";
      return 1;
    }
    assert(keymap.map[0][0][0].repeat == 0);
  }
  std::cout << "-- R48 valodi 2-es es 3-as mentes is atjon az uj formatumba\n";

  // R49) Ismeretlen (tul uj) verzio elutasitva
  loadDefaultKeymap();
  keymap.version = 99; keymap.crc = keymapCrc(keymap);
  assert(writeFileAtomic("/keymap.bin", "/keymap.tmp", &keymap, sizeof(keymap)));
  memset(&keymap, 0, sizeof(keymap));
  assert(!loadKeymap());
  std::cout << "-- R49 ismeretlen formatum-verzio elutasitva\n";
  loadDefaultKeymap(); g_fs.erase("/keymap.bin");

  // R50) Leutes-impulzus hossza: legalabb egy 60 Hz-es mintavetel (16,7 ms)
  assert(repeatTapMs >= 17);
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  longPressStart4(); longPress4();
  assert(g_keyCount == 1 && g_keyReleaseCount == 0);   // meg tart az impulzus
  g_millis += 10; updateRepeatTap();
  assert(g_keyReleaseCount == 0);                       // 10 ms utan meg nem
  g_millis += 15; updateRepeatTap();
  assert(g_keyReleaseCount == 1);                       // 25 ms utan igen
  longPressStop4();
  std::cout << "-- R50 a leutes-impulzus " << repeatTapMs << " ms, nem blokkolo\n";

  // R51) Vezeto szokozos parancs is ertelmezheto
  expect(send("  PING"), "OK ZWIFT_BUTTONS", "vezeto szokozok atugorva");
  expect(send("\tGET"), "END", "vezeto tabulator atugorva");
  std::cout << "-- R51 vezeto szokozok nem nemitjak el a valaszt\n";

  // R52) Zaro biztonsagi felengedes elveszett notifikacio ellen
  loadDefaultKeymap();
  resetKeyState();
  longPressStart4(); longPress4(); settleTap();
  assert(pressedTargetCount > 0);      // a celpontok megmaradnak
  longPressStop4();
  int rel52 = g_keyReleaseCount;
  loop(); g_millis += 200; loop();
  if (g_keyReleaseCount <= rel52) {
    std::cout << "HIBA R52: nincs zaro biztonsagi felengedes\n";
    return 1;
  }
  std::cout << "-- R52 a gomb elengedesekor zaro felengedes is kimegy\n";

  // R53) Cel-felulbiralas BARMELYIK cellan (nem csak a Media/hosszu harmason)
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1);
  connectPeer(0, 0xA0); connectPeer(1, 0xB0);
  send("ASSIGN 0 0"); send("ASSIGN 1 1");
  {
    // Minden uzemmod / gomb / esemeny elfogadja a 9. mezot.
    int refused = 0;
    for (int m = 0; m < ZW_NUM_MODES; m++)
      for (int b = 0; b < ZW_NUM_BUTTONS; b++)
        for (int e = 0; e < ZW_NUM_EVENTS; e++) {
          char c[64];
          snprintf(c, sizeof(c), "SET %d %d %d 1 0 81 0 60 2", m, b, e);
          if (send(c).find("OK") == std::string::npos) refused++;
        }
    if (refused) {
      std::cout << "HIBA R53: " << refused << " cella nem fogadta el a cel-felulbiralast\n";
      return 1;
    }
    // …es tenyleg ervenyesul ott is, ahol eddig nem lehetett beallitani.
    loadDefaultKeymap();
    expect(send("SETTARGET 0 1"), "OK", "Normal uzemmod -> csak PC");
    expect(send("SET 0 0 0 1 0 80 0 60 2"), "OK", "Normal/G1/rovid -> csak telefon");
    expect(send("SET 0 1 1 1 0 79 0 60 2"), "OK", "Normal/G2/dupla -> csak telefon");
    jelenlegiUzemmod = normalUzemmod;

    resetKeyState();
    click1(); g_millis += 200; loop();
    if (!(g_sentTo[0] == 0 && g_sentTo[1] == 1)) {
      std::cout << "HIBA R53: rovid nyomas felulbiralasa nem ervenyesult (PC="
                << g_sentTo[0] << " telefon=" << g_sentTo[1] << ")\n";
      return 1;
    }
    resetKeyState();
    doubleclick2(); g_millis += 200; loop();
    if (!(g_sentTo[0] == 0 && g_sentTo[1] == 1)) {
      std::cout << "HIBA R53: dupla kattintas felulbiralasa nem ervenyesult (PC="
                << g_sentTo[0] << " telefon=" << g_sentTo[1] << ")\n";
      return 1;
    }
    // A felulbiralas nelkuli cella tovabbra is az uzemmod celpontjat hasznalja.
    resetKeyState();
    click3(); g_millis += 200; loop();
    assert(g_sentTo[0] == 1 && g_sentTo[1] == 0);
  }
  std::cout << "-- R53 cel-felulbiralas minden cellan mukodik, a tobbi orokol\n";

  // R54) A gyari kiosztasban tovabbra is CSAK a Media/G1-G3 hosszu van felulbiralva
  loadDefaultKeymap();
  {
    int overridden = 0;
    for (int m = 0; m < ZW_NUM_MODES; m++)
      for (int b = 0; b < ZW_NUM_BUTTONS; b++)
        for (int e = 0; e < ZW_NUM_EVENTS; e++)
          if (keymap.map[m][b][e].target) {
            overridden++;
            bool expected = (m == 2 && e == EV_LONG && b <= 2
                             && keymap.map[m][b][e].target == ZW_TARGET_PC);
            if (!expected) {
              std::cout << "HIBA R54: varatlan gyari felulbiralas " << m << "/" << b
                        << "/" << e << " = " << (int)keymap.map[m][b][e].target << "\n";
              return 1;
            }
          }
    if (overridden != 3) {
      std::cout << "HIBA R54: " << overridden << " gyari felulbiralas (vart: 3)\n";
      return 1;
    }
  }
  std::cout << "-- R54 gyarilag csak a Media/G1-G3 hosszu ter el, a tobbi orokol\n";

