manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
  // R55) Media kod: a HID leiro 0x03FF-ig hirdet, a folotte levot ne fogadjuk el
  loadDefaultKeymap();
  expect(send("SET 2 0 0 2 0 207 0 60"), "OK", "Siri (0x00CF) elfogadva");
  expect(send("GET"), "MAP 2 0 0 2 0 207 0 60", "a 0x00CF vissza is olvashato");
  expect(send("SET 2 0 0 2 0 1023 0 60"), "OK", "a tartomany teteje (0x03FF) meg jo");
  expect(send("SET 2 0 0 2 0 1024 0 60"), "ERR VALUE", "0x0400 mar elutasitva");
  expect(send("SET 2 0 0 2 0 65535 0 60"), "ERR VALUE", "0xFFFF elutasitva");
  // Billentyu-muveletnel valtozatlanul a 0xFF a hatar
  expect(send("SET 2 0 0 1 0 256 0 60"), "ERR VALUE", "billentyunel tovabbra is 0xFF");
  std::cout << "-- R55 media kod a HID tartomanyon kivul elutasitva\n";

  // R56) Fuggo lenyomas + kozben indulo ismetles: a regi celponton se ragadjon be
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1);
  connectPeer(0, 0xA0); connectPeer(1, 0xB0);
  send("ASSIGN 0 0"); send("ASSIGN 1 1");
  jelenlegiUzemmod = mediaVezerloUzemmod;
  resetKeyState();
  for (int i = 0; i < 8; i++) g_releasedTo[i] = 0;
  // Media/G1/rovid = media billentyu, orokli az uzemmod celpontjat -> MINDKETTO
  click1();
  loop();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 1);
  assert(hasConsumerKeyPressed);
  // Meg a 100 ms-os felengedes elott indul a G2 hosszu nyomas: Alt+Tab, CSAK a PC-re
  g_millis += 30;
  longPressStart2(); longPress2();
  for (int i = 0; i < 40; i++) { g_millis += 25; loop(); }
  longPressStop2();
  for (int i = 0; i < 40; i++) { g_millis += 25; loop(); }
  if (g_releasedTo[1] == 0) {
    std::cout << "HIBA R56: a telefon nem kapott felengedest, a media billentyu"
              << " beragadt (PC-re " << g_releasedTo[0] << ", telefonra "
              << g_releasedTo[1] << ")\n";
    return 1;
  }
  assert(!hasKeyPressed && !hasConsumerKeyPressed && pressedTargetCount == 0);
  std::cout << "-- R56 az ismetles atvetele elott a fuggo lenyomas felengedodik\n";

  // R57) Uzemmod-valtas ismetles kozben, ha az UJ muvelet IS ismetlodo, de mast kuld
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(1);                  // egy kapcsolat eleg, konnyebb szamolni
  jelenlegiUzemmod = normalUzemmod;   // G4 hosszu = Le nyil (BILLENTYU), ismetlodo
  resetKeyState();
  longPressStart4(); longPress4();
  assert(g_keyCount == 1 && g_consumerCount == 0);
  {
    int relBefore = g_keyReleaseCount;
    send("MODE 2");                   // Media: G4 hosszu = Hangero- (MEDIA), szinten ismetlodo
    for (int i = 0; i < 10; i++) { g_millis += 100; longPress4(); }
    if (g_keyReleaseCount == relBefore) {
      std::cout << "HIBA R57: a billentyus ismetles felengedes nelkul maradt, "
                << "miutan az uj uzemmod media billentyut ismetel\n";
      return 1;
    }
    if (g_consumerCount != 0) {
      std::cout << "HIBA R57: a valtas utan az ismetles nem allt le\n";
      return 1;
    }
  }
  longPressStop4();
  for (int i = 0; i < 10; i++) { g_millis += 50; loop(); }
  assert(!hasKeyPressed && !hasConsumerKeyPressed && pressedTargetCount == 0);
  jelenlegiUzemmod = normalUzemmod;
  std::cout << "-- R57 mas muveletre valto ismetles rendesen lezarul\n";

  // R58) Lassu fociklus: a leutesek kozti felengedes akkor sem maradhat ki
  loadDefaultKeymap();
  jelenlegiUzemmod = normalUzemmod;   // 30 ms-os ismetles, kulon leutesekkel
  resetKeyState();
  longPressStart4();
  for (int i = 0; i < 12; i++) {
    g_millis += 35;                   // hosszabb kor, mint az ismetlesi ido
    updateRepeatTap();
    longPress4();
  }
  if (g_keyReleaseCount < g_keyCount - 1) {
    std::cout << "HIBA R58: lassu koroknel elmaradnak a felengedesek ("
              << g_keyCount << " leutes, " << g_keyReleaseCount << " felengedes)\n";
    return 1;
  }
  longPressStop4();
  for (int i = 0; i < 5; i++) { g_millis += 50; loop(); }
  std::cout << "-- R58 lassu koroknel is minden leutest felengedes kovet\n";

  // R59) Idozitett kuldes rovid nyomasnal: tartas, felengedes nelkul
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(1);
  jelenlegiUzemmod = normalUzemmod;
  expect(send("SET 0 0 0 1 0 80 0 60 0 1000"), "OK", "G1 rovid = 1000 ms-ig tartva");
  expect(send("GET"), "MAP 0 0 0 1 0 80 0 60 0 1000", "a 10. mezo visszaolvashato");
  resetKeyState();
  click1();
  assert(g_keyCount == 1);            // egyetlen lenyomas
  {
    int rel = g_keyReleaseCount;
    // A kuldes alatt a fociklus nem enged fel, es nem is kuld semmi mast.
    for (int i = 0; i < 15; i++) { g_millis += 10; loop(); }
    if (g_keyCount != 1) {
      std::cout << "HIBA R59: idozitett kuldes kozben masik parancs is kiment ("
                << g_keyCount << " leutes)\n";
      return 1;
    }
    if (g_keyReleaseCount != rel) {
      std::cout << "HIBA R59: a billentyu korabban felengedodott\n";
      return 1;
    }
    assert(burstActive);
  }
  // az ido letelte utan felengedodik es ujra lehet parancsot kuldeni
  // (a kor most 5 ms-ot var, mert idozitett kuldes van folyamatban)
  for (int i = 0; i < 40; i++) { g_millis += 30; loop(); }
  if (g_keyReleaseCount == 0) {
    std::cout << "HIBA R59: a beallitott ido utan sem lett felengedve\n";
    return 1;
  }
  assert(!burstActive && !duringLongpress && !hasKeyPressed);
  resetKeyState();
  click2(); loop();
  assert(g_keyCount == 1);            // a kuldes vege utan mar mehet mas
  std::cout << "-- R59 rovid nyomas idozitett kuldese vegigtart\n";

  // R59b) Futo kuldest barmelyik gombnyomas megszakit, de a sajat parancsa
  //       mar nem megy ki - igy sosem torlodik ket parancs egymasra.
  loadDefaultKeymap();
  jelenlegiUzemmod = normalUzemmod;
  expect(send("SET 0 0 0 1 0 80 0 60 0 5000"), "OK", "G1 rovid = 5 masodperc");
  resetKeyState();
  click1();
  assert(burstActive && g_keyCount == 1);
  {
    int before = g_keyCount;
    click2();                          // masik gomb: megszakit
    if (burstActive) {
      std::cout << "HIBA R59b: a gombnyomas nem szakitotta meg a kuldest\n";
      return 1;
    }
    if (g_keyCount != before) {
      std::cout << "HIBA R59b: a megszakito gombnyomas parancsa is kiment\n";
      return 1;
    }
  }
  // a megszakitas utan felengedodik, es a kovetkezo gombnyomas mar mukodik
  for (int i = 0; i < 10; i++) { g_millis += 50; loop(); }
  assert(g_keyReleaseCount >= 1 && !hasKeyPressed);
  resetKeyState();
  click2(); loop();
  assert(g_keyCount == 1);
  std::cout << "-- R59b a futo kuldes megszakithato, a megszakito nyomas nem kuld\n";

  // R60) Idozitett kuldes kulon leutesekkel (dupla kattintas)
  loadDefaultKeymap();
  jelenlegiUzemmod = normalUzemmod;
  expect(send("SET 0 0 1 1 0 80 3 100 0 1000"), "OK", "G1 dupla = 1000 ms, 100 ms-onkent");
  resetKeyState();
  doubleclick1();
  for (int i = 0; i < 60; i++) { g_millis += 20; loop(); }
  // 1000 ms alatt 100 ms-onkent: nagysagrendileg 10 leutes, mindegyik felengedve
  if (g_keyCount < 8 || g_keyCount > 12) {
    std::cout << "HIBA R60: " << g_keyCount << " leutes ment ki (vart: ~10)\n";
    return 1;
  }
  if (g_keyReleaseCount < g_keyCount - 1) {
    std::cout << "HIBA R60: " << g_keyReleaseCount << " felengedes " << g_keyCount
              << " leutesre\n";
    return 1;
  }
  assert(!burstActive && !hasKeyPressed && !hasConsumerKeyPressed);
  std::cout << "-- R60 idozitett kuldes kulon leutesekkel a beallitott utemben\n";

  // R61) A hossz csak rovid/dupla nyomasnal ervenyes, es kell hozza ismetles-ido
  expect(send("SET 0 0 2 1 0 80 0 60 0 1000"), "ERR VALUE", "hosszu nyomasnal nincs hossz");
  expect(send("SET 0 0 0 1 0 80 3 100 0 6000"), "ERR VALUE", "5000 ms folott elutasitva");
  expect(send("SET 0 0 0 1 0 80 3 100 0 0"), "ERR VALUE", "ismetles hossz nelkul ertelmetlen");
  expect(send("SET 0 0 0 1 0 80 0 60 0 0"), "OK", "hossz nelkul a regi viselkedes");
  expect(send("SET 0 0 0 4 0 0 0 60 0 1000"), "ERR VALUE", "nezetvaltas nem tarthato nyomva");
  expect(send("SET 0 0 0 3 0 0 0 60 0 1000"), "ERR VALUE", "uzemmodvaltas sem");
  std::cout << "-- R61 a kuldesi hossz ervenyessege ellenorzott\n";

