manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
  // c) Tartos hiba eseten se ragadjon be az eszkoz orokre
  resetKeyState();
  click1();
  assert(hasKeyPressed);
  g_notifyFail = 1000;                  // minden tovabbi kuldes elbukik
  for (int i = 0; i < 60; i++) { g_millis += 30; loop(); }
  if (hasKeyPressed || pressedTargetCount != 0) {
    std::cout << "HIBA R67: tartos kuldesi hiba eseten vegleg beragad az allapot\n";
    return 1;
  }
  g_notifyFail = 0;
  resetKeyState();
  click2(); 
  assert(g_keyCount == 1);              // utana ujra mukodik
  std::cout << "-- R67 elveszett ertesites: felengedes ujrakuldve, lenyomas nem hazudik\n";

  // R68) Egyszerre (ugyanabban a korben) megnyomott gombok
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1);
  connectPeer(0, 0xA0);
  jelenlegiUzemmod = normalUzemmod;

  // a) Ket rovid nyomas ugyanabban a korben: csak az elso megy ki (a masodik
  //    nem torlodhat ra), de a masodik semmit nem ront el.
  resetKeyState();
  click1();                       // Balra nyil
  click3();                       // Jobbra nyil - a 100 ms-os ablakon belul
  if (g_keyCount != 1 || g_lastPressedCode != HID_KEY_ARROW_LEFT) {
    std::cout << "HIBA R68a: " << g_keyCount << " billentyu ment ki, utolso 0x"
              << std::hex << (int)g_lastPressedCode << std::dec << "\n";
    return 1;
  }
  for (int i = 0; i < 10; i++) { g_millis += 30; loop(); }
  assert(!hasKeyPressed && pressedTargetCount == 0);
  // b) A felengedes utan viszont a masodik gomb is mukodik
  resetKeyState();
  click3();
  assert(g_keyCount == 1 && g_lastPressedCode == HID_KEY_ARROW_RIGHT);
  for (int i = 0; i < 10; i++) { g_millis += 30; loop(); }

  // c) Ket hosszu nyomas egyszerre: a kesobb indulo veszi at, a masik nem
  //    ragad be, es a vegen tiszta az allapot.
  expect(send("SET 0 0 2 1 0 80 3 100"), "OK", "G1 hosszu = ismetlodo balra");
  expect(send("SET 0 2 2 1 0 79 3 100"), "OK", "G3 hosszu = ismetlodo jobbra");
  resetKeyState();
  longPressStart1(); longPressStart3();
  assert(repeatButton == 2);      // a G3 vette at
  for (int i = 0; i < 4; i++) { g_millis += 120; updateRepeatTap(); longPress1(); longPress3(); }
  if (g_lastPressedCode != HID_KEY_ARROW_RIGHT) {
    std::cout << "HIBA R68c: nem az atvevo gomb billentyuje megy ki\n";
    return 1;
  }
  longPressStop1(); longPressStop3();
  for (int i = 0; i < 10; i++) { g_millis += 50; loop(); }
  assert(!hasKeyPressed && !hasConsumerKeyPressed && pressedTargetCount == 0);

  // d) Az uzemmodvaltas akkor is lefut, ha epp mas parancs van folyamatban:
  //    nem kuld BLE-re, ezert nem torlodhat semmivel.
  loadDefaultKeymap();
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  click1();
  doubleclick4();
  if (jelenlegiUzemmod != versenyEdzesUzemmod) {
    std::cout << "HIBA R68d: az uzemmodvaltas elmaradt\n";
    return 1;
  }
  jelenlegiUzemmod = normalUzemmod;
  for (int i = 0; i < 10; i++) { g_millis += 50; loop(); }
  std::cout << "-- R68 egyszerre nyomott gombok: nincs torlodas es nincs beragadas\n";

  // R69) Fizikailag beragadt gomb: a longPressStop soha nem erkezik meg
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1);
  connectPeer(0, 0xA0);
  jelenlegiUzemmod = normalUzemmod;      // G4 hosszu = ismetlodo le nyil
  resetKeyState();
  longPressStart4();
  // 25 masodpercig meg rendes nyomva tartas: ismetel
  for (int i = 0; i < 800; i++) { g_millis += 30; updateRepeatTap(); longPress4(); }
  assert(g_keyCount > 0);
  // 35 masodperc utan mar beragadtnak kell tekintenie
  for (int i = 0; i < 400; i++) { g_millis += 30; updateRepeatTap(); longPress4(); loop(); }
  int afterStuck = g_keyCount;
  for (int i = 0; i < 200; i++) { g_millis += 30; updateRepeatTap(); longPress4(); loop(); }
  if (g_keyCount != afterStuck) {
    std::cout << "HIBA R69: a beragadt gomb tovabb szorja a billentyut ("
              << (g_keyCount - afterStuck) << " tovabbi leutes)\n";
    return 1;
  }
  // a) a tobbi gomb ujra hasznalhato
  {
    int before = g_keyCount;
    resetKeyState();
    click1();
    if (g_keyCount == 0) {
      std::cout << "HIBA R69: a beragadt gomb miatt a tobbi gomb is nema marad\n";
      return 1;
    }
    (void)before;
  }
  // b) az eszkoz el tud aludni: a tetlensegi szamlalot mar nem nullazza
  watchdogCounter = 0;
  for (int i = 0; i < 50; i++) { g_millis += 30; longPress4(); watchdogCounter++; }
  if (watchdogCounter == 0) {
    std::cout << "HIBA R69: a beragadt gomb ebren tartja az eszkozt\n";
    return 1;
  }
  // c) felengedes utan a gomb ujra mukodik
  longPressStop4();
  for (int i = 0; i < 10; i++) { g_millis += 50; loop(); }
  resetKeyState();
  longPressStart4(); longPress4();
  if (g_keyCount == 0) {
    std::cout << "HIBA R69: felengedes utan sem eled fel a gomb\n";
    return 1;
  }
  longPressStop4();
  for (int i = 0; i < 10; i++) { g_millis += 50; loop(); }
  assert(!hasKeyPressed && pressedTargetCount == 0);
  std::cout << "-- R69 beragadt gomb: leall, nem tiltja a tobbit, engedi az alvast\n";

  // R70) Bekapcsolaskor / ebredeskor mar nyomott gomb
  // Az ebredes a System OFF-bol ujraindulas, ezert ez a ketto ugyanaz az eset.
  {
    // A Gomb 4 a 4-es tuskén van (BUTTON_PIN_INDEX). Beragadva indulunk.
    g_pinLow[4] = true;
    setup();                         // ujrainditas szimulalasa
    send("DBG 0");
    loadDefaultKeymap();
    send("CLEARSLOT 0"); send("CLEARSLOT 1");
    disconnectPeer(0); disconnectPeer(1);
    connectPeer(0, 0xA0);
    jelenlegiUzemmod = normalUzemmod;

    resetKeyState();
    longPressStart4();               // a OneButton 800 ms utan ezt kuldene
    for (int i = 0; i < 100; i++) { g_millis += 30; updateRepeatTap(); longPress4(); loop(); }
    if (g_keyCount != 0) {
      std::cout << "HIBA R70: az induláskor nyomott gomb parancsa kiment ("
                << g_keyCount << " leutes)\n";
      return 1;
    }
    // a tobbi gomb kozben hasznalhato
    resetKeyState();
    click1();
    assert(g_keyCount == 1);
    for (int i = 0; i < 10; i++) { g_millis += 30; loop(); }
    // es az eszkoz el tud aludni (a szamlalo no)
    watchdogCounter = 0;
    for (int i = 0; i < 50; i++) { g_millis += 30; longPress4(); watchdogCounter++; }
    assert(watchdogCounter > 0);
    // felengedes utan a gomb ujra mukodik
    g_pinLow[4] = false;
    longPressStop4();
    for (int i = 0; i < 10; i++) { g_millis += 50; loop(); }
    resetKeyState();
    longPressStart4(); longPress4();
    if (g_keyCount == 0) {
      std::cout << "HIBA R70: felengedes utan sem eled fel a gomb\n";
      return 1;
    }
    longPressStop4();
    for (int i = 0; i < 10; i++) { g_millis += 50; loop(); }
  }

  // b) Alvas, amikor az EBRESZTO gomb van nyomva: a System OFF-ot a DETECT jel
  //    azonnal megszakitana, ujrainditasi hurkot okozva.
  g_systemOffCount = 0;
  g_pinLow[WAKEUP_PIN] = true;
  watchdogCounter = 0;
  for (int i = 0; i < 1000; i++) fct_Watchdog();
  if (g_systemOffCount != 0) {
    std::cout << "HIBA R70: elaludt, pedig az ebreszto gomb nyomva van - "
              << "azonnal ujraindulna\n";
    return 1;
  }
  g_pinLow[WAKEUP_PIN] = false;
  g_systemOffCount = 0;
  fct_Watchdog();
  if (g_systemOffCount != 1) {
    std::cout << "HIBA R70: felengedes utan sem alszik el\n";
    return 1;
  }
  fct_WatchdogReset();
  std::cout << "-- R70 induláskor nyomott gomb es beragadt ebreszto gomb kezelve\n";

  // R71) Megszakadt konfig-mentes (aramszunet / ujrainditas mentes kozben)
  // A mentes atmeneti fajlba ir, es csak hibatlan kiiras utan nevezi at. A
  // littlefs atnevezese aramszunet-biztos (DESIGN.md: globalis allapot +
  // helyreallitas mount-kor), tehat vagy a REGI, vagy az UJ tartalom marad.
  {
    loadDefaultKeymap();
    expect(send("SET 0 0 0 1 0 4 0 60"), "OK", "kiindulasi ertek");
    assert(saveKeymap());
    assert(keymap.map[0][0][0].code == 0x04);

    // a) Megszakadas az atmeneti fajl irasa kozben
    expect(send("SET 0 0 0 1 0 5 0 60"), "OK", "uj, el nem mentett ertek");
    g_fsWriteFail = true;
    bool saved = saveKeymap();
    g_fsWriteFail = false;
    assert(!saved);                       // a mentes hibat jelez
    memset(&keymap, 0, sizeof(keymap));   // "ujrainditas"
    if (!loadKeymap() || keymap.map[0][0][0].code != 0x04) {
      std::cout << "HIBA R71a: megszakadt iras utan elveszett a korabbi mentes\n";
      return 1;
    }

    // b) Megszakadas az atnevezes elott
    expect(send("SET 0 0 0 1 0 6 0 60"), "OK", "ujabb ertek");
    g_fsRenameFail = true;
    saved = saveKeymap();
    g_fsRenameFail = false;
    assert(!saved);
    memset(&keymap, 0, sizeof(keymap));
    if (!loadKeymap() || keymap.map[0][0][0].code != 0x04) {
      std::cout << "HIBA R71b: megszakadt atnevezes utan elveszett a mentes\n";
      return 1;
    }

    // c) Ottmaradt (szemet) atmeneti fajl nem zavarja a kovetkezo mentest
    g_fs["/keymap.tmp"] = std::string(200, 'X');
    expect(send("SET 0 0 0 1 0 7 0 60"), "OK", "harmadik ertek");
    if (!saveKeymap()) {
      std::cout << "HIBA R71c: ottmaradt atmeneti fajl utan nem sikerul a mentes\n";
      return 1;
    }
    memset(&keymap, 0, sizeof(keymap));
    if (!loadKeymap() || keymap.map[0][0][0].code != 0x07) {
      std::cout << "HIBA R71c: a mentes nem az uj tartalmat orizte meg\n";
      return 1;
    }

    // d) Csonka fajl (fel-irodott) - nem szabad betolteni
    g_fs["/keymap.bin"].resize(200);
    memset(&keymap, 0, sizeof(keymap));
    if (loadKeymap()) {
      std::cout << "HIBA R71d: csonka fajlt is betolt\n";
      return 1;
    }

