manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
    // c) Ha az egyik kapcsolat kiesik, a masik tovabbra is kap ertesitest -
    //    es nem az utoljara felepult kapcsolat kezelese donti el, hogy kap-e
    disconnectPeer(1);
    for (int i = 0; i < 8; i++) g_batteryNotified[i] = -1;
    g_adcRaw = 1936;                    // ~4,2 V -> mas szazalek
    updateBatteryTest(true);
    if (g_batteryNotified[0] != g_batteryPercent) {
      std::cout << "HIBA R75: a megmaradt kapcsolat nem kap ertesitest ("
                << g_batteryNotified[0] << ")\n";
      return 1;
    }
    if (g_batteryNotified[1] != -1) {
      std::cout << "HIBA R75: a bontott kapcsolatra is megy ertesites\n";
      return 1;
    }

    // d) Kapcsolat nelkul is frissul a helyi ertek (ezt olvassa ki a host
    //    csatlakozaskor), de ertesites nem megy sehova
    disconnectPeer(0);
    g_batteryNotifyCount = 0;
    g_adcRaw = 1521;                    // ~3,3 V
    g_batteryPercent = -1;
    updateBatteryTest(true);
    if (g_batteryPercent < 0) {
      std::cout << "HIBA R75: kapcsolat nelkul nem frissul a helyi ertek\n";
      return 1;
    }
    if (g_batteryNotifyCount != 0) {
      std::cout << "HIBA R75: kapcsolat nelkul is ertesit\n";
      return 1;
    }
    connectPeer(0, 0xA0);
  }
  std::cout << "-- R75 akku-szint: minden elo kapcsolat kap ertesitest\n";

  // R76) A host GATT gyorsitotaranak ervenytelenitese. Ez az oka annak, hogy egy
  //      firmware-frissitesben UJONNAN felvett szolgaltatas (pl. az akku-szint)
  //      a mar parositott gepen nem jelenik meg: a bondolt host a mentett
  //      szolgaltatas-tablat hasznalja. A "Service Changed" indikacio szol neki,
  //      hogy deritse fel ujra.
  {
    disconnectPeer(0); disconnectPeer(1);
    resetKeyState();
    g_svcChangedCount = 0; g_svcChangedFail = 0;
    for (int i = 0; i < 8; i++) g_svcChangedTo[i] = 0;

    // a) Bondolt kapcsolat: a jelzes NEM azonnal megy ki, hanem kesleltetve —
    //    a titkositas es a mentett CCCD-k visszaallitasa meg tarthat.
    connectPeer(0, 0xA0, true);
    loop();
    if (g_svcChangedCount != 0) {
      std::cout << "HIBA R76: a GATT-valtozas azonnal kiment, kesleltetes nelkul\n";
      return 1;
    }
    g_millis += ZW_GATT_CHANGED_DELAY_MS + 1;
    loop();
    if (g_svcChangedTo[0] != 1) {
      std::cout << "HIBA R76: a bondolt kapcsolat nem kapott GATT-valtozas jelzest ("
                << g_svcChangedTo[0] << ")\n";
      return 1;
    }
    // A tartomany az alkalmazas elso handle-jetol a tabla vegeig tart.
    if (g_svcChangedStart != 0x000C || g_svcChangedEnd != 0xFFFF) {
      std::cout << "HIBA R76: rossz handle-tartomany (" << g_svcChangedStart
                << ".." << g_svcChangedEnd << ")\n";
      return 1;
    }

    // b) Kapcsolatonkent EGYSZER, nem minden korben: folosleges radioforgalom
    //    lenne, es a host minden jelzesre ujra felderitene a tablat.
    for (int i = 0; i < 20; i++) { g_millis += 1000; loop(); }
    if (g_svcChangedTo[0] != 1) {
      std::cout << "HIBA R76: ismetelten megy ki a jelzes (" << g_svcChangedTo[0] << ")\n";
      return 1;
    }

    // c) Ha a peer meg nem engedelyezte az indikaciot, a SoftDevice hibat ad.
    //    Ilyenkor ujra kell probalni: a mentett rendszer-attributumok
    //    visszaallitasa kesobb is megtortenhet.
    disconnectPeer(0);
    for (int i = 0; i < 8; i++) g_svcChangedTo[i] = 0;
    g_svcChangedFail = 2;
    connectPeer(0, 0xA0, true);
    g_millis += ZW_GATT_CHANGED_DELAY_MS + 1;
    loop();
    if (g_svcChangedTo[0] != 0) {
      std::cout << "HIBA R76: a stub hibat adott, megis sikeresnek szamit\n";
      return 1;
    }
    for (int i = 0; i < 3; i++) { g_millis += ZW_GATT_CHANGED_RETRY_MS + 1; loop(); }
    if (g_svcChangedTo[0] != 1) {
      std::cout << "HIBA R76: hiba utan nem probalja ujra (" << g_svcChangedTo[0] << ")\n";
      return 1;
    }

    // d) Tartos hiba eseten a probalkozas veget er, nem porog vegtelenul.
    disconnectPeer(0);
    for (int i = 0; i < 8; i++) g_svcChangedTo[i] = 0;
    g_svcChangedFail = 1000;
    connectPeer(0, 0xA0, true);
    for (int i = 0; i < 30; i++) { g_millis += ZW_GATT_CHANGED_RETRY_MS + 1; loop(); }
    if (g_svcChangedFail != 1000 - ZW_GATT_CHANGED_TRIES) {
      std::cout << "HIBA R76: nem pont " << ZW_GATT_CHANGED_TRIES
                << " probalkozas tortent (maradek=" << g_svcChangedFail << ")\n";
      return 1;
    }
    g_svcChangedFail = 0;

    // e) Parositatlan eszkoz semmit nem tarolt el ket kapcsolat kozott: az
    //    minden csatlakozaskor felderiti a tablat, neki nincs mit jelezni.
    disconnectPeer(0);
    for (int i = 0; i < 8; i++) g_svcChangedTo[i] = 0;
    connectPeer(0, 0xA0, false);
    for (int i = 0; i < 10; i++) { g_millis += ZW_GATT_CHANGED_RETRY_MS + 1; loop(); }
    if (g_svcChangedTo[0] != 0) {
      std::cout << "HIBA R76: parositatlan eszkoznek is megy GATT-valtozas jelzes\n";
      return 1;
    }
    disconnectPeer(0);

    // f) A parositas kesobb is befejezodhet, mint ahogy az elso probalkozas
    //    esedekes lenne. Ilyenkor nem szabad veglegesen feladni: ez pont az az
    //    eset, amikor a hostnak a legnagyobb szuksege van a jelzesre.
    for (int i = 0; i < 8; i++) g_svcChangedTo[i] = 0;
    connectPeer(0, 0xA0, false);
    g_millis += ZW_GATT_CHANGED_DELAY_MS + 1;
    loop();
    g_conns[0].bonded = true;           // most fejezodott be a parositas
    g_millis += ZW_GATT_CHANGED_RETRY_MS + 1;
    loop();
    if (g_svcChangedTo[0] != 1) {
      std::cout << "HIBA R76: a kesobb parositott eszkoz nem kapott jelzest ("
                << g_svcChangedTo[0] << ")\n";
      return 1;
    }
    disconnectPeer(0);
  }
  std::cout << "-- R76 GATT-valtozas jelzese: bondolt hosttal ujra felderitteti a tablat\n";

  // R77) Frissen csatlakozott eszkoz megkapja az aktualis toltottseget, nem kell
  //      megvarnia a kovetkezo percenkenti frissitest.
  {
    disconnectPeer(0); disconnectPeer(1);
    resetKeyState();
    g_adcRaw = 1706;
    updateBatteryTest(true);            // legyen ismert aktualis ertek
    int pct = g_batteryPercent;

    for (int i = 0; i < 8; i++) g_batteryNotified[i] = -1;
    connectPeer(1, 0xB0, true);
    loop();
    if (g_batteryNotified[1] != -1) {
      std::cout << "HIBA R77: azonnal ertesit, kesleltetes nelkul\n";
      return 1;
    }
    g_millis += ZW_BATTERY_ANNOUNCE_MS + 1;
    loop();
    if (g_batteryNotified[1] != pct) {
      std::cout << "HIBA R77: az uj kapcsolat nem kapta meg a toltottseget ("
                << g_batteryNotified[1] << " helyett " << pct << ")\n";
      return 1;
    }

    // Egyszer, es csak neki: a masik kapcsolatot nem zavarjuk vele.
    g_batteryNotifyCount = 0;
    for (int i = 0; i < 10; i++) { g_millis += 1000; loop(); }
    if (g_batteryNotifyCount != 0) {
      std::cout << "HIBA R77: ismetelten ertesit a csatlakozas utan\n";
      return 1;
    }
    disconnectPeer(1);
  }
  std::cout << "-- R77 uj kapcsolat azonnal megkapja az akku-szintet\n";

  // R78) A BAT parancs: a hoston egyetlen szam latszik (vagy semmi), ebbol kell
  //      kideruljon, hogy a meres rossz, a szolgaltatas nem indult el, vagy a
  //      host nem is kerdezi.
  {
    disconnectPeer(0); disconnectPeer(1);
    connectPeer(0, 0xA0, true);
    g_adcRaw = 1936;                    // ~4,2 V
    updateBatteryTest(true);
    std::string r = send("BAT");
    if (r.find("OK BAT RAW=1936 ") != 0 || r.find(" BAS=1 ") == std::string::npos
        || r.find(" CONN=1 ") == std::string::npos) {
      std::cout << "HIBA R78: rossz BAT valasz: " << r << "\n";
      return 1;
    }
    // Toltesjelzes: a ~CHG lab (P0.17 / D23) LOW-ra huzva jelent toltest.
    if (r.find(" CHG=0") == std::string::npos) {
      std::cout << "HIBA R78: nem toltes kozben is toltest jelent: " << r << "\n";
      return 1;
    }
    g_pinLow[ZW_CHARGE_STATE_PIN] = true;
    r = send("BAT");
    if (r.find(" CHG=1") == std::string::npos) {
      std::cout << "HIBA R78: toltes kozben sem jelent toltest: " << r << "\n";
      return 1;
    }
    g_pinLow[ZW_CHARGE_STATE_PIN] = false;
    // A jelentett szazalek ugyanaz, amit a BLE-n is kikuldtunk.
    char pctMezo[16], sentMezo[16];
    snprintf(pctMezo, sizeof(pctMezo), " PCT=%d ", g_batteryPercent);
    snprintf(sentMezo, sizeof(sentMezo), " SENT=%d ", g_batteryPercent);
    if (r.find(pctMezo) == std::string::npos || r.find(sentMezo) == std::string::npos) {
      std::cout << "HIBA R78: a BAT mast jelent, mint amit kikuldtunk: " << r
                << " (vart:" << pctMezo << "es" << sentMezo << ")\n";
      return 1;
    }
  }
  std::cout << "-- R78 BAT parancs jelenti a meres es a szolgaltatas allapotat\n";

  // R79) Az ADC beallitasa az akku-osztohoz. Ez nem stiluskerdes: az oszto
  //      forrasellenallasa 1 MOhm || 510 kOhm = 338 kOhm, a nRF52840 Product
  //      Specification v1.11 41. tablazata (6.23.1.2 Acquisition time) szerint
  //      pedig 400 kOhm-ig 20 us mintaveteli ido kell. A konyvtar
  //      alapertelmezese 3 us (csak 10 kOhm-ig eleg), amivel a mintavevo
  //      kondenzator nem tolt fel, es a meres rendszeresen alacsonyabbat ad.
  //      Ha valaki kiveszi ezt a beallitast, a meres csendben elromlana.
  {
    if (g_adcSampleTime < 20) {
      std::cout << "HIBA R79: a mintaveteli ido " << g_adcSampleTime
                << " us, az oszto 338 kOhm-jahoz legalabb 20 us kell\n";
      return 1;
    }
    // Tulmintavetelezes: a PS 6.23.2.4 szerint a jel-zaj viszonyt javitja.
    if (g_adcOversampling < 2) {
      std::cout << "HIBA R79: nincs tulmintavetelezes (" << g_adcOversampling
                << "), a mintaveteli zaj csillapitatlan marad\n";
      return 1;
    }
  }
  std::cout << "-- R79 ADC: az oszto forrasellenallasahoz illo mintaveteli ido\n";

  // R80) Media (consumer) muvelet nem nulla modositoval, NYOMVA TARTOTT
  //      ismetlessel. A media jelentes nem visz modositot (a consumerKeyPress()
  //      csak a usage kodot kuldi), ezert a lenyomat modositoja 0. Ha az
  //      "ugyanaz van-e lenyomva" osszehasonlitas a muvelet nem nulla
  //      modositojaval dolgozna, sosem egyezne, es minden ismetles kore
  //      folosleges felengedes + ujra lenyomas lenne - pont az ellenkezoje
  //      annak, amit a nyomva tartott mod jelent.
  {
    disconnectPeer(0); disconnectPeer(1);
    connectPeer(0, 0xA0);
    loadDefaultKeymap();
    jelenlegiUzemmod = normalUzemmod;
    resetKeyState();
    settleTap();

    // Gomb 1 / hosszu: media hangero+, nem nulla modositoval, nyomva tartva.
    setAction(0, 0, EV_LONG, ACT_CONSUMER, KEYBOARD_MODIFIER_LEFTCTRL,
              HID_USAGE_CONSUMER_VOLUME_INCREMENT, ZW_REPEAT_ENABLED, 30);
    g_consumerCount = 0; g_consumerReleaseCount = 0;

