manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
    longPressStart1();
    longPress1();
    if (g_consumerCount != 1 || g_consumerReleaseCount != 0) {
      std::cout << "HIBA R80: az elso kuldes nem egyetlen lenyomas (kuldes="
                << g_consumerCount << " felengedes=" << g_consumerReleaseCount << ")\n";
      return 1;
    }
    // Tovabbi ismetlesek: a billentyu VEGIG lenyomva marad, kozben egyetlen
    // felengedes sem mehet ki.
    for (int i = 0; i < 3; i++) { g_millis += 40; longPress1(); }
    if (g_consumerReleaseCount != 0) {
      std::cout << "HIBA R80: nyomva tartott media-ismetles kozben "
                << g_consumerReleaseCount << " felengedes ment ki (0 helyett)\n";
      return 1;
    }
    if (g_consumerCount != 4) {
      std::cout << "HIBA R80: nem minden ismetles ment ki (" << g_consumerCount << ")\n";
      return 1;
    }
    if (!duringLongpress || !hasConsumerKeyPressed) {
      std::cout << "HIBA R80: a tulajdonos nem jelzi a lenyomast\n";
      return 1;
    }

    // A gomb elengedesekor a fociklus egyetlen zaro felengedest kuld.
    longPressStop1();
    loop(); g_millis += 200; loop();
    if (g_consumerReleaseCount != 1 || hasConsumerKeyPressed) {
      std::cout << "HIBA R80: a zaro felengedes nem pontosan egyszer ment ki ("
                << g_consumerReleaseCount << ")\n";
      return 1;
    }
    loadDefaultKeymap();
    resetKeyState();
  }
  std::cout << "-- R80 media muvelet modositoval: nyomva tartva nem enged fel kozben\n";

  // R81) ADC eltolas-kalibralas. Ket kulon allitas:
  //      1. INDULASKOR fusson le, de csak ott. A Nordic allasfoglalasa szerint a
  //         program indulasakor kalibralni eleg, es maga a kalibralas is zajos —
  //         egymas utani futtatasai elteronek adodnak. Meresenkent kalibralva
  //         tehat epp ezt a szorast vinnenk bele minden leolvasasba.
  //      2. NE VARJON KORLAT NELKUL. A konyvtar analogCalibrateOffset()-je
  //         `while (!EVENTS_CALIBRATEDONE);`-nal all; a setup()-ban ez azert
  //         veszelyes, mert a hardveres watchdogot szandekosan csak legvegul
  //         inditjuk - ott egy beragadt periferia kezi resetig halott eszkozt
  //         jelentene. Ezert sajat, idokorlatos valtozatot hasznalunk.
  {
    // a) A meres NEM kalibral: az induláskori beallitast hasznalja.
    g_saadcCalibStuck = false;
    g_saadcCalibCount = 0;
    g_adcRaw = 1936;
    updateBatteryTest(true);
    (void)send("BAT");
    if (g_saadcCalibCount != 0) {
      std::cout << "HIBA R81: meresenkent kalibral (" << g_saadcCalibCount
                << "), pedig csak indulaskor szabadna\n";
      return 1;
    }

    // b) Beragadt periferia: az idokorlat kivezet a varakozasbol. Ha ez a teszt
    //    valaha lefagy, pont az a hiba all vissza, ami ellen keszult.
    g_saadcCalibStuck = true;
    unsigned long elotte = g_millis;
    bool ok = adcCalibrateTest();     // ha vegtelen ciklus lenne, itt allna meg
    if (ok) {
      std::cout << "HIBA R81: beragadt periferia mellett sikeresnek mondja magat\n";
      return 1;
    }
    if ((g_millis - elotte) > ZW_ADC_CALIB_TIMEOUT_MS + 2) {
      std::cout << "HIBA R81: az idokorlat nem tartott ("
                << (g_millis - elotte) << " ms)\n";
      return 1;
    }
    // Idotullepes utan sem maradhat bekapcsolva a SAADC: folyamatosan fogyasztana.
    if (NRF_SAADC->ENABLE != 0) {
      std::cout << "HIBA R81: idotullepes utan bekapcsolva maradt a SAADC\n";
      return 1;
    }

    // c) Ep hardveren sikerul, es a SAADC-t utana ki is kapcsolja.
    g_saadcCalibStuck = false;
    if (!adcCalibrateTest()) {
      std::cout << "HIBA R81: ep hardveren sem sikerul a kalibralas\n";
      return 1;
    }
    if (NRF_SAADC->ENABLE != 0) {
      std::cout << "HIBA R81: a SAADC bekapcsolva maradt a kalibralas utan\n";
      return 1;
    }

    // d) A setup() (azaz minden indulas es alvasbol ebredes) kalibral, es a
    //    sikeresseget a BAT is jelenti.
    g_saadcCalibCount = 0;
    setup();                          // ujrainditas szimulalasa
    if (g_saadcCalibCount != 1) {
      std::cout << "HIBA R81: a setup() nem pontosan egyszer kalibral ("
                << g_saadcCalibCount << ")\n";
      return 1;
    }
    connectPeer(0, 0xA0);
    std::string r = send("BAT");
    if (r.find(" CAL=1") == std::string::npos) {
      std::cout << "HIBA R81: a BAT nem jelent sikeres kalibralast: " << r << "\n";
      return 1;
    }

    // e) Ha a kalibralas indulaskor elbukik, az eszkoz ettol meg elindul es mer
    //    tovabb - csak a BAT jelzi, hogy kalibralatlanul.
    g_saadcCalibStuck = true;
    setup();
    g_saadcCalibStuck = false;
    NRF_SAADC->EVENTS_CALIBRATEDONE = 0;
    connectPeer(0, 0xA0);
    g_adcRaw = 1936;
    g_batteryPercent = -1;
    updateBatteryTest(true);
    if (g_batteryPercent < 0) {
      std::cout << "HIBA R81: sikertelen kalibralas utan nincs meres\n";
      return 1;
    }
    r = send("BAT");
    if (r.find(" CAL=0") == std::string::npos) {
      std::cout << "HIBA R81: a BAT nem jelzi a sikertelen kalibralast: " << r << "\n";
      return 1;
    }
  }
  std::cout << "-- R81 ADC-kalibralas: csak indulaskor, es idokorlattal\n";

  std::cout << "\nMINDEN TESZT SIKERES\n";
  return 0;
}
